hdscmcu/sdk-csp-hc32f4/libraries/cmsis/Device/HDSC/hc32f4xx/Include/hc32f467.h
/**
 *******************************************************************************
 ** \brief Event number enumeration
 ******************************************************************************/
typedef enum {
    EVT_SRC_SWI_IRQ0             = 0U,
    EVT_SRC_SWI_IRQ1             = 1U,
    EVT_SRC_SWI_IRQ2             = 2U,
    EVT_SRC_SWI_IRQ3             = 3U,
    EVT_SRC_SWI_IRQ4             = 4U,
    EVT_SRC_SWI_IRQ5             = 5U,
    EVT_SRC_SWI_IRQ6             = 6U,
    EVT_SRC_SWI_IRQ7             = 7U,
    EVT_SRC_SWI_IRQ8             = 8U,
    EVT_SRC_SWI_IRQ9             = 9U,
    EVT_SRC_SWI_IRQ10            = 10U,
    EVT_SRC_SWI_IRQ11            = 11U,
    EVT_SRC_SWI_IRQ12            = 12U,
    EVT_SRC_SWI_IRQ13            = 13U,
    EVT_SRC_SWI_IRQ14            = 14U,
    EVT_SRC_SWI_IRQ15            = 15U,
    EVT_SRC_SWI_IRQ16            = 16U,
    EVT_SRC_SWI_IRQ17            = 17U,
    EVT_SRC_SWI_IRQ18            = 18U,
    EVT_SRC_SWI_IRQ19            = 19U,
    EVT_SRC_SWI_IRQ20            = 20U,
    EVT_SRC_SWI_IRQ21            = 21U,
    EVT_SRC_SWI_IRQ22            = 22U,
    EVT_SRC_SWI_IRQ23            = 23U,
    EVT_SRC_SWI_IRQ24            = 24U,
    EVT_SRC_SWI_IRQ25            = 25U,
    EVT_SRC_SWI_IRQ26            = 26U,
    EVT_SRC_SWI_IRQ27            = 27U,
    EVT_SRC_SWI_IRQ28            = 28U,
    EVT_SRC_SWI_IRQ29            = 29U,
    EVT_SRC_SWI_IRQ30            = 30U,
    EVT_SRC_SWI_IRQ31            = 31U,
    /* External Interrupt  */
    EVT_SRC_PORT_EIRQ0           = 0U,      /* PORT_EIRQ0 */
    EVT_SRC_PORT_EIRQ1           = 1U,      /* PORT_EIRQ1 */
    EVT_SRC_PORT_EIRQ2           = 2U,      /* PORT_EIRQ2 */
    EVT_SRC_PORT_EIRQ3           = 3U,      /* PORT_EIRQ3 */
    EVT_SRC_PORT_EIRQ4           = 4U,      /* PORT_EIRQ4 */
    EVT_SRC_PORT_EIRQ5           = 5U,      /* PORT_EIRQ5 */
    EVT_SRC_PORT_EIRQ6           = 6U,      /* PORT_EIRQ6 */
    EVT_SRC_PORT_EIRQ7           = 7U,      /* PORT_EIRQ7 */
    EVT_SRC_PORT_EIRQ8           = 8U,      /* PORT_EIRQ8 */
    EVT_SRC_PORT_EIRQ9           = 9U,      /* PORT_EIRQ9 */
    EVT_SRC_PORT_EIRQ10          = 10U,     /* PORT_EIRQ10 */
    EVT_SRC_PORT_EIRQ11          = 11U,     /* PORT_EIRQ11 */
    EVT_SRC_PORT_EIRQ12          = 12U,     /* PORT_EIRQ12 */
    EVT_SRC_PORT_EIRQ13          = 13U,     /* PORT_EIRQ13 */
    EVT_SRC_PORT_EIRQ14          = 14U,     /* PORT_EIRQ14 */
    EVT_SRC_PORT_EIRQ15          = 15U,     /* PORT_EIRQ15 */
    /*  DMA_1  */
    EVT_SRC_DMA1_TC0             = 32U,     /* DMA_1_TC0 */
    EVT_SRC_DMA1_TC1             = 33U,     /* DMA_1_TC1 */
    EVT_SRC_DMA1_TC2             = 34U,     /* DMA_1_TC2 */
    EVT_SRC_DMA1_TC3             = 35U,     /* DMA_1_TC3 */
    EVT_SRC_DMA1_TC4             = 36U,     /* DMA_1_TC4 */
    EVT_SRC_DMA1_TC5             = 37U,     /* DMA_1_TC5 */
    EVT_SRC_DMA1_TC6             = 38U,     /* DMA_1_TC6 */
    EVT_SRC_DMA1_TC7             = 39U,     /* DMA_1_TC7 */
    EVT_SRC_DMA1_BTC0            = 40U,     /* DMA_1_BTC0 */
    EVT_SRC_DMA1_BTC1            = 41U,     /* DMA_1_BTC1 */
    EVT_SRC_DMA1_BTC2            = 42U,     /* DMA_1_BTC2 */
    EVT_SRC_DMA1_BTC3            = 43U,     /* DMA_1_BTC3 */
    EVT_SRC_DMA1_BTC4            = 44U,     /* DMA_1_BTC4 */
    EVT_SRC_DMA1_BTC5            = 45U,     /* DMA_1_BTC5 */
    EVT_SRC_DMA1_BTC6            = 46U,     /* DMA_1_BTC6 */
    EVT_SRC_DMA1_BTC7            = 47U,     /* DMA_1_BTC7 */
    /*  EFM  */
    EVT_SRC_EFM_OPTEND           = 51U,     /* EFM_OPTEND */
    /*  USBFS  */
    EVT_SRC_USBFS_SOF            = 52U,     /* USBFS_SOF */
    /*  USBHS  */
    EVT_SRC_USBHS_SOF            = 53U,     /* USBHS_SOF */
    /*  DCU  */
    EVT_SRC_DCU1                 = 55U,     /* DCU1 */
    EVT_SRC_DCU2                 = 56U,     /* DCU2 */
    EVT_SRC_DCU3                 = 57U,     /* DCU3 */
    EVT_SRC_DCU4                 = 58U,     /* DCU4 */
    EVT_SRC_DCU5                 = 59U,     /* DCU5 */
    EVT_SRC_DCU6                 = 60U,     /* DCU6 */
    EVT_SRC_DCU7                 = 61U,     /* DCU7 */
    EVT_SRC_DCU8                 = 62U,     /* DCU8 */
    /*  DMA_2  */
    EVT_SRC_DMA2_TC0             = 64U,     /* DMA_2_TC0 */
    EVT_SRC_DMA2_TC1             = 65U,     /* DMA_2_TC1 */
    EVT_SRC_DMA2_TC2             = 66U,     /* DMA_2_TC2 */
    EVT_SRC_DMA2_TC3             = 67U,     /* DMA_2_TC3 */
    EVT_SRC_DMA2_TC4             = 68U,     /* DMA_2_TC4 */
    EVT_SRC_DMA2_TC5             = 69U,     /* DMA_2_TC5 */
    EVT_SRC_DMA2_TC6             = 70U,     /* DMA_2_TC6 */
    EVT_SRC_DMA2_TC7             = 71U,     /* DMA_2_TC7 */
    EVT_SRC_DMA2_BTC0            = 72U,     /* DMA_2_BTC0 */
    EVT_SRC_DMA2_BTC1            = 73U,     /* DMA_2_BTC1 */
    EVT_SRC_DMA2_BTC2            = 74U,     /* DMA_2_BTC2 */
    EVT_SRC_DMA2_BTC3            = 75U,     /* DMA_2_BTC3 */
    EVT_SRC_DMA2_BTC4            = 76U,     /* DMA_2_BTC4 */
    EVT_SRC_DMA2_BTC5            = 77U,     /* DMA_2_BTC5 */
    EVT_SRC_DMA2_BTC6            = 78U,     /* DMA_2_BTC6 */
    EVT_SRC_DMA2_BTC7            = 79U,     /* DMA_2_BTC7 */
    /*  MAU  */
    EVT_SRC_MAU_SQRT             = 83U,     /* MAU_SQRT */
    /*  DVP  */
    EVT_SRC_DVP_FRAMSTA          = 84U,     /* DVP_FRAMSTA */
    EVT_SRC_DVP_LINESTA          = 85U,     /* DVP_LINESTA */
    EVT_SRC_DVP_LINEEND          = 86U,     /* DVP_LINEEND */
    EVT_SRC_DVP_FRAMEND          = 87U,     /* DVP_FRAMEND */
    EVT_SRC_DVP_SQUERR           = 88U,     /* DVP_SQUERR */
    EVT_SRC_DVP_FIFOERR          = 89U,     /* DVP_FIFOERR */
    EVT_SRC_DVP_DMAREQ           = 90U,     /* DVP_DMAREQ */
    /*  FMAC  */
    EVT_SRC_FMAC_1               = 91U,     /* FMAC_1_FIR */
    EVT_SRC_FMAC_2               = 92U,     /* FMAC_2_FIR */
    EVT_SRC_FMAC_3               = 93U,     /* FMAC_3_FIR */
    EVT_SRC_FMAC_4               = 94U,     /* FMAC_4_FIR */
    /*  TIMER0  */
    EVT_SRC_TMR0_1_CMP_A         = 96U,     /* TMR0_1_CMPA */
    EVT_SRC_TMR0_1_CMP_B         = 97U,     /* TMR0_1_CMPB */
    EVT_SRC_TMR0_2_CMP_A         = 98U,     /* TMR0_2_CMPA */
    EVT_SRC_TMR0_2_CMP_B         = 99U,     /* TMR0_2_CMPB */
    /*  RTC  */
    EVT_SRC_RTC_ALM              = 121U,    /* RTC_ALM */
    EVT_SRC_RTC_PRD              = 122U,    /* RTC_PRD */
    /*  TIMER6_1  */
    EVT_SRC_TMR6_1_GCMP_A        = 128U,    /* TMR6_1_GCMA */
    EVT_SRC_TMR6_1_GCMP_B        = 129U,    /* TMR6_1_GCMB */
    EVT_SRC_TMR6_1_GCMP_C        = 130U,    /* TMR6_1_GCMC */
    EVT_SRC_TMR6_1_GCMP_D        = 131U,    /* TMR6_1_GCMD */
    EVT_SRC_TMR6_1_GCMP_E        = 132U,    /* TMR6_1_GCME */
    EVT_SRC_TMR6_1_GCMP_F        = 133U,    /* TMR6_1_GCMF */
    EVT_SRC_TMR6_1_OVF           = 134U,    /* TMR6_1_GOVF */
    EVT_SRC_TMR6_1_UDF           = 135U,    /* TMR6_1_GUDF */
    /*  TIMER4_1  */
    EVT_SRC_TMR4_1_SCMP0         = 136U,    /* TMR4_1_SCM0 */
    EVT_SRC_TMR4_1_SCMP1         = 137U,    /* TMR4_1_SCM1 */
    EVT_SRC_TMR4_1_SCMP2         = 138U,    /* TMR4_1_SCM2 */
    EVT_SRC_TMR4_1_SCMP3         = 139U,    /* TMR4_1_SCM3 */
    EVT_SRC_TMR4_1_SCMP4         = 140U,    /* TMR4_1_SCM4 */
    EVT_SRC_TMR4_1_SCMP5         = 141U,    /* TMR4_1_SCM5 */
    /*  TIMER6_2  */
    EVT_SRC_TMR6_2_GCMP_A        = 144U,    /* TMR6_2_GCMA */
    EVT_SRC_TMR6_2_GCMP_B        = 145U,    /* TMR6_2_GCMB */
    EVT_SRC_TMR6_2_GCMP_C        = 146U,    /* TMR6_2_GCMC */
    EVT_SRC_TMR6_2_GCMP_D        = 147U,    /* TMR6_2_GCMD */
    EVT_SRC_TMR6_2_GCMP_E        = 148U,    /* TMR6_2_GCME */
    EVT_SRC_TMR6_2_GCMP_F        = 149U,    /* TMR6_2_GCMF */
    EVT_SRC_TMR6_2_OVF           = 150U,    /* TMR6_2_GOVF */
    EVT_SRC_TMR6_2_UDF           = 151U,    /* TMR6_2_GUDF */
    /*  TIMER4_2  */
    EVT_SRC_TMR4_2_SCMP0         = 152U,    /* TMR4_2_SCM0 */
    EVT_SRC_TMR4_2_SCMP1         = 153U,    /* TMR4_2_SCM1 */
    EVT_SRC_TMR4_2_SCMP2         = 154U,    /* TMR4_2_SCM2 */
    EVT_SRC_TMR4_2_SCMP3         = 155U,    /* TMR4_2_SCM3 */
    EVT_SRC_TMR4_2_SCMP4         = 156U,    /* TMR4_2_SCM4 */
    EVT_SRC_TMR4_2_SCMP5         = 157U,    /* TMR4_2_SCM5 */
    /*  TIMER6_3  */
    EVT_SRC_TMR6_3_GCMP_A        = 160U,    /* TMR6_3_GCMA */
    EVT_SRC_TMR6_3_GCMP_B        = 161U,    /* TMR6_3_GCMB */
    EVT_SRC_TMR6_3_GCMP_C        = 162U,    /* TMR6_3_GCMC */
    EVT_SRC_TMR6_3_GCMP_D        = 163U,    /* TMR6_3_GCMD */
    EVT_SRC_TMR6_3_GCMP_E        = 164U,    /* TMR6_3_GCME */
    EVT_SRC_TMR6_3_GCMP_F        = 165U,    /* TMR6_3_GCMF */
    EVT_SRC_TMR6_3_OVF           = 166U,    /* TMR6_3_GOVF */
    EVT_SRC_TMR6_3_UDF           = 167U,    /* TMR6_3_GUDF */
    /*  TIMER4_3  */
    EVT_SRC_TMR4_3_SCMP0         = 168U,    /* TMR4_3_SCM0 */
    EVT_SRC_TMR4_3_SCMP1         = 169U,    /* TMR4_3_SCM1 */
    EVT_SRC_TMR4_3_SCMP2         = 170U,    /* TMR4_3_SCM2 */
    EVT_SRC_TMR4_3_SCMP3         = 171U,    /* TMR4_3_SCM3 */
    EVT_SRC_TMR4_3_SCMP4         = 172U,    /* TMR4_3_SCM4 */
    EVT_SRC_TMR4_3_SCMP5         = 173U,    /* TMR4_3_SCM5 */
    /*  TIMER6  */
    EVT_SRC_TMR6_1_SCMP_A        = 179U,    /* TMR6_1_SCMA */
    EVT_SRC_TMR6_1_SCMP_B        = 180U,    /* TMR6_1_SCMB */
    EVT_SRC_TMR6_2_SCMP_A        = 187U,    /* TMR6_2_SCMA */
    EVT_SRC_TMR6_2_SCMP_B        = 188U,    /* TMR6_2_SCMB */
    EVT_SRC_TMR6_3_SCMP_A        = 195U,    /* TMR6_3_SCMA */
    EVT_SRC_TMR6_3_SCMP_B        = 196U,    /* TMR6_3_SCMB */
    /*  TIMERA_1  */
    EVT_SRC_TMRA_1_OVF           = 237U,    /* TMRA_1_OVF */
    EVT_SRC_TMRA_1_UDF           = 238U,    /* TMRA_1_UDF */
    EVT_SRC_TMRA_1_CMP           = 239U,    /* TMRA_1_CMP */
    /*  TIMERA_2  */
    EVT_SRC_TMRA_2_OVF           = 253U,    /* TMRA_2_OVF */
    EVT_SRC_TMRA_2_UDF           = 254U,    /* TMRA_2_UDF */
    EVT_SRC_TMRA_2_CMP           = 255U,    /* TMRA_2_CMP */
    /*  TIMERA_3  */
    EVT_SRC_TMRA_3_OVF           = 269U,    /* TMRA_3_OVF */
    EVT_SRC_TMRA_3_UDF           = 270U,    /* TMRA_3_UDF */
    EVT_SRC_TMRA_3_CMP           = 271U,    /* TMRA_3_CMP */
    /*  TIMERA_4  */
    EVT_SRC_TMRA_4_OVF           = 285U,    /* TMRA_4_OVF */
    EVT_SRC_TMRA_4_UDF           = 286U,    /* TMRA_4_UDF */
    EVT_SRC_TMRA_4_CMP           = 287U,    /* TMRA_4_CMP */
    /*  AOS_STRG  */
    EVT_SRC_AOS_STRG             = 299U,    /* AOS_STRG */
    /*  USART1 USART2  */
    EVT_SRC_USART1_EI            = 300U,    /* USART_1_EI */
    EVT_SRC_USART1_RI            = 301U,    /* USART_1_RI */
    EVT_SRC_USART1_TI            = 302U,    /* USART_1_TI */
    EVT_SRC_USART1_TCI           = 303U,    /* USART_1_TCI */
    EVT_SRC_USART1_RTO           = 304U,    /* USART_1_RTO */
    EVT_SRC_USART2_EI            = 305U,    /* USART_2_EI */
    EVT_SRC_USART2_RI            = 306U,    /* USART_2_RI */
    EVT_SRC_USART2_TI            = 307U,    /* USART_2_TI */
    EVT_SRC_USART2_TCI           = 308U,    /* USART_2_TCI */
    EVT_SRC_USART2_RTO           = 309U,    /* USART_2_RTO */
    /*  SPI1 SPI2  */
    EVT_SRC_SPI1_SPRI            = 310U,    /* SPI_1_SPRI */
    EVT_SRC_SPI1_SPTI            = 311U,    /* SPI_1_SPTI */
    EVT_SRC_SPI1_SPII            = 312U,    /* SPI_1_SPII */
    EVT_SRC_SPI1_SPEI            = 313U,    /* SPI_1_SPEI */
    EVT_SRC_SPI1_SPEND           = 314U,    /* SPI_1_SPEND */
    EVT_SRC_SPI2_SPRI            = 315U,    /* SPI_2_SPRI */
    EVT_SRC_SPI2_SPTI            = 316U,    /* SPI_2_SPTI */
    EVT_SRC_SPI2_SPII            = 317U,    /* SPI_2_SPII */
    EVT_SRC_SPI2_SPEI            = 318U,    /* SPI_2_SPEI */
    EVT_SRC_SPI2_SPEND           = 319U,    /* SPI_2_SPEND */
    /*  TIMERA_5 TIMERA_6 TIMERA_7 TIMERA_8  */
    EVT_SRC_TMRA_5_OVF           = 320U,    /* TMRA_5_OVF */
    EVT_SRC_TMRA_5_UDF           = 321U,    /* TMRA_5_UDF */
    EVT_SRC_TMRA_5_CMP           = 322U,    /* TMRA_5_CMP */
    EVT_SRC_TMRA_6_OVF           = 323U,    /* TMRA_6_OVF */
    EVT_SRC_TMRA_6_UDF           = 324U,    /* TMRA_6_UDF */
    EVT_SRC_TMRA_6_CMP           = 325U,    /* TMRA_6_CMP */
    EVT_SRC_TMRA_7_OVF           = 326U,    /* TMRA_7_OVF */
    EVT_SRC_TMRA_7_UDF           = 327U,    /* TMRA_7_UDF */
    EVT_SRC_TMRA_7_CMP           = 328U,    /* TMRA_7_CMP */
    EVT_SRC_TMRA_8_OVF           = 329U,    /* TMRA_8_OVF */
    EVT_SRC_TMRA_8_UDF           = 330U,    /* TMRA_8_UDF */
    EVT_SRC_TMRA_8_CMP           = 331U,    /* TMRA_8_CMP */
    /*  USART3 USART4  */
    EVT_SRC_USART3_EI            = 332U,    /* USART_3_EI */
    EVT_SRC_USART3_RI            = 333U,    /* USART_3_RI */
    EVT_SRC_USART3_TI            = 334U,    /* USART_3_TI */
    EVT_SRC_USART3_TCI           = 335U,    /* USART_3_TCI */
    EVT_SRC_USART4_EI            = 336U,    /* USART_4_EI */
    EVT_SRC_USART4_RI            = 337U,    /* USART_4_RI */
    EVT_SRC_USART4_TI            = 338U,    /* USART_4_TI */
    EVT_SRC_USART4_TCI           = 339U,    /* USART_4_TCI */
    /*  SPI3 SPI4  */
    EVT_SRC_SPI3_SPRI            = 342U,    /* SPI_3_SPRI */
    EVT_SRC_SPI3_SPTI            = 343U,    /* SPI_3_SPTI */
    EVT_SRC_SPI3_SPII            = 344U,    /* SPI_3_SPII */
    EVT_SRC_SPI3_SPEI            = 345U,    /* SPI_3_SPEI */
    EVT_SRC_SPI3_SPEND           = 346U,    /* SPI_3_SPEND */
    EVT_SRC_SPI4_SPRI            = 347U,    /* SPI_4_SPRI */
    EVT_SRC_SPI4_SPTI            = 348U,    /* SPI_4_SPTI */
    EVT_SRC_SPI4_SPII            = 349U,    /* SPI_4_SPII */
    EVT_SRC_SPI4_SPEI            = 350U,    /* SPI_4_SPEI */
    EVT_SRC_SPI4_SPEND           = 351U,    /* SPI_4_SPEND */
    /*  USART5 USART6  */
    EVT_SRC_USART5_BRKWKPI       = 364U,    /* USART_5_BRKWKPI */
    EVT_SRC_USART5_EI            = 365U,    /* USART_5_EI */
    EVT_SRC_USART5_RI            = 366U,    /* USART_5_RI */
    EVT_SRC_USART5_TI            = 367U,    /* USART_5_TI */
    EVT_SRC_USART5_TCI           = 368U,    /* USART_5_TCI */
    EVT_SRC_USART6_EI            = 369U,    /* USART_6_EI */
    EVT_SRC_USART6_RI            = 370U,    /* USART_6_RI */
    EVT_SRC_USART6_TI            = 371U,    /* USART_6_TI */
    EVT_SRC_USART6_TCI           = 372U,    /* USART_6_TCI */
    EVT_SRC_USART6_RTO           = 373U,    /* USART_6_RTO */
    /*  SPI5 SPI6  */
    EVT_SRC_SPI5_SPRI            = 374U,    /* SPI_5_SPRI */
    EVT_SRC_SPI5_SPTI            = 375U,    /* SPI_5_SPTI */
    EVT_SRC_SPI5_SPII            = 376U,    /* SPI_5_SPII */
    EVT_SRC_SPI5_SPEI            = 377U,    /* SPI_5_SPEI */
    EVT_SRC_SPI5_SPEND           = 378U,    /* SPI_5_SPEND */
    EVT_SRC_SPI6_SPRI            = 379U,    /* SPI_6_SPRI */
    EVT_SRC_SPI6_SPTI            = 380U,    /* SPI_6_SPTI */
    EVT_SRC_SPI6_SPII            = 381U,    /* SPI_6_SPII */
    EVT_SRC_SPI6_SPEI            = 382U,    /* SPI_6_SPEI */
    EVT_SRC_SPI6_SPEND           = 383U,    /* SPI_6_SPEND */
    /*  I2S1 I2S2  */
    EVT_SRC_I2S1_TXIRQOUT        = 384U,    /* I2S_1_TXIRQOUT */
    EVT_SRC_I2S1_RXIRQOUT        = 385U,    /* I2S_1_RXIRQOUT */
    EVT_SRC_I2S2_TXIRQOUT        = 387U,    /* I2S_2_TXIRQOUT */
    EVT_SRC_I2S2_RXIRQOUT        = 388U,    /* I2S_2_RXIRQOUT */
    /*  USART7  */
    EVT_SRC_USART7_EI            = 390U,    /* USART_7_EI */
    EVT_SRC_USART7_RI            = 391U,    /* USART_7_RI */
    EVT_SRC_USART7_TI            = 392U,    /* USART_7_TI */
    EVT_SRC_USART7_TCI           = 393U,    /* USART_7_TCI */
    EVT_SRC_USART7_RTO           = 394U,    /* USART_7_RTO */
    /*  HASH  */
    EVT_SRC_HASH                 = 401U,    /* HASH_INT */
    /*  SDIOC  */
    EVT_SRC_SDIOC1_DMAR          = 402U,    /* SDIOC_1_DMAR */
    EVT_SRC_SDIOC1_DMAW          = 403U,    /* SDIOC_1_DMAW */
    EVT_SRC_SDIOC2_DMAR          = 405U,    /* SDIOC_2_DMAR */
    EVT_SRC_SDIOC2_DMAW          = 406U,    /* SDIOC_2_DMAW */
    /*  EVENT PORT  */
    EVT_SRC_EVENT_PORT1          = 408U,    /* EVENT_PORT1 */
    EVT_SRC_EVENT_PORT2          = 409U,    /* EVENT_PORT2 */
    EVT_SRC_EVENT_PORT3          = 410U,    /* EVENT_PORT3 */
    EVT_SRC_EVENT_PORT4          = 411U,    /* EVENT_PORT4 */
    /*  I2S3 I2S4  */
    EVT_SRC_I2S3_TXIRQOUT        = 416U,    /* I2S_3_TXIRQOUT */
    EVT_SRC_I2S3_RXIRQOUT        = 417U,    /* I2S_3_RXIRQOUT */
    EVT_SRC_I2S4_TXIRQOUT        = 419U,    /* I2S_4_TXIRQOUT */
    EVT_SRC_I2S4_RXIRQOUT        = 420U,    /* I2S_4_RXIRQOUT */
    /*  USART10  */
    EVT_SRC_USART10_BRKWKPI      = 426U,    /* USART_10_BRKWKPI */
    EVT_SRC_USART10_EI           = 427U,    /* USART_10_EI */
    EVT_SRC_USART10_RI           = 428U,    /* USART_10_RI */
    EVT_SRC_USART10_TI           = 429U,    /* USART_10_TI */
    EVT_SRC_USART10_TCI          = 430U,    /* USART_10_TCI */
    /*  I2C1 I2C2 I2C3  */
    EVT_SRC_I2C1_RXI             = 432U,    /* I2C_1_RXI */
    EVT_SRC_I2C1_TXI             = 433U,    /* I2C_1_TXI */
    EVT_SRC_I2C1_TEI             = 434U,    /* I2C_1_TEI */
    EVT_SRC_I2C1_EEI             = 435U,    /* I2C_1_EEI */
    EVT_SRC_I2C2_RXI             = 436U,    /* I2C_2_RXI */
    EVT_SRC_I2C2_TXI             = 437U,    /* I2C_2_TXI */
    EVT_SRC_I2C2_TEI             = 438U,    /* I2C_2_TEI */
    EVT_SRC_I2C2_EEI             = 439U,    /* I2C_2_EEI */
    EVT_SRC_I2C3_RXI             = 440U,    /* I2C_3_RXI */
    EVT_SRC_I2C3_TXI             = 441U,    /* I2C_3_TXI */
    EVT_SRC_I2C3_TEI             = 442U,    /* I2C_3_TEI */
    EVT_SRC_I2C3_EEI             = 443U,    /* I2C_3_EEI */
    /*  ACMP  */
    EVT_SRC_CMP1                 = 444U,    /* CMP1 */
    EVT_SRC_CMP2                 = 445U,    /* CMP2 */
    EVT_SRC_CMP3                 = 446U,    /* CMP3 */
    /*  LVD  */
    EVT_SRC_LVD1                = 461U,    /* LVD1 */
    EVT_SRC_LVD2                = 462U,    /* LVD2 */
    /*  OTS  */
    EVT_SRC_OTS                  = 463U,    /* OTS */
    /*  WDT  */
    EVT_SRC_WDT_REFUDF           = 467U,    /* WDT_REFUDF */
    /*  ADC  */
    EVT_SRC_ADC1_EOCA            = 480U,    /* ADC_1_EOCA */
    EVT_SRC_ADC1_EOCB            = 481U,    /* ADC_1_EOCB */
    EVT_SRC_ADC1_CMP0            = 482U,    /* ADC_1_CMP0 */
    EVT_SRC_ADC1_CMP1            = 483U,    /* ADC_1_CMP1 */
    EVT_SRC_ADC2_EOCA            = 484U,    /* ADC_2_EOCA */
    EVT_SRC_ADC2_EOCB            = 485U,    /* ADC_2_EOCB */
    EVT_SRC_ADC2_CMP0            = 486U,    /* ADC_2_CMP0 */
    EVT_SRC_ADC2_CMP1            = 487U,    /* ADC_2_CMP1 */
    EVT_SRC_ADC3_EOCA            = 488U,    /* ADC_3_EOCA */
    EVT_SRC_ADC3_EOCB            = 489U,    /* ADC_3_EOCB */
    EVT_SRC_ADC3_CMP0            = 490U,    /* ADC_3_CMP0 */
    EVT_SRC_ADC3_CMP1            = 491U,    /* ADC_3_CMP1 */
    /*  TRNG  */
    EVT_SRC_TRNG_END             = 492U,    /* TRNG_END */
    EVT_SRC_MAX                  = 511U,
} en_event_src_t;

