hdscmcu/sdk-csp-hc32f4/libraries/cmsis/Device/HDSC/hc32f4xx/Include/hc32f467.h
/**
 *******************************************************************************
 ** \brief Interrupt number enumeration
 ******************************************************************************/
typedef enum {
    INT_SRC_SWI_IRQ0             = 0U,
    INT_SRC_SWI_IRQ1             = 1U,
    INT_SRC_SWI_IRQ2             = 2U,
    INT_SRC_SWI_IRQ3             = 3U,
    INT_SRC_SWI_IRQ4             = 4U,
    INT_SRC_SWI_IRQ5             = 5U,
    INT_SRC_SWI_IRQ6             = 6U,
    INT_SRC_SWI_IRQ7             = 7U,
    INT_SRC_SWI_IRQ8             = 8U,
    INT_SRC_SWI_IRQ9             = 9U,
    INT_SRC_SWI_IRQ10            = 10U,
    INT_SRC_SWI_IRQ11            = 11U,
    INT_SRC_SWI_IRQ12            = 12U,
    INT_SRC_SWI_IRQ13            = 13U,
    INT_SRC_SWI_IRQ14            = 14U,
    INT_SRC_SWI_IRQ15            = 15U,
    INT_SRC_SWI_IRQ16            = 16U,
    INT_SRC_SWI_IRQ17            = 17U,
    INT_SRC_SWI_IRQ18            = 18U,
    INT_SRC_SWI_IRQ19            = 19U,
    INT_SRC_SWI_IRQ20            = 20U,
    INT_SRC_SWI_IRQ21            = 21U,
    INT_SRC_SWI_IRQ22            = 22U,
    INT_SRC_SWI_IRQ23            = 23U,
    INT_SRC_SWI_IRQ24            = 24U,
    INT_SRC_SWI_IRQ25            = 25U,
    INT_SRC_SWI_IRQ26            = 26U,
    INT_SRC_SWI_IRQ27            = 27U,
    INT_SRC_SWI_IRQ28            = 28U,
    INT_SRC_SWI_IRQ29            = 29U,
    INT_SRC_SWI_IRQ30            = 30U,
    INT_SRC_SWI_IRQ31            = 31U,
    /*  External Interrupt   */
    INT_SRC_PORT_EIRQ0           = 0U,      /* PORT_EIRQ0 */
    INT_SRC_PORT_EIRQ1           = 1U,      /* PORT_EIRQ1 */
    INT_SRC_PORT_EIRQ2           = 2U,      /* PORT_EIRQ2 */
    INT_SRC_PORT_EIRQ3           = 3U,      /* PORT_EIRQ3 */
    INT_SRC_PORT_EIRQ4           = 4U,      /* PORT_EIRQ4 */
    INT_SRC_PORT_EIRQ5           = 5U,      /* PORT_EIRQ5 */
    INT_SRC_PORT_EIRQ6           = 6U,      /* PORT_EIRQ6 */
    INT_SRC_PORT_EIRQ7           = 7U,      /* PORT_EIRQ7 */
    INT_SRC_PORT_EIRQ8           = 8U,      /* PORT_EIRQ8 */
    INT_SRC_PORT_EIRQ9           = 9U,      /* PORT_EIRQ9 */
    INT_SRC_PORT_EIRQ10          = 10U,     /* PORT_EIRQ10 */
    INT_SRC_PORT_EIRQ11          = 11U,     /* PORT_EIRQ11 */
    INT_SRC_PORT_EIRQ12          = 12U,     /* PORT_EIRQ12 */
    INT_SRC_PORT_EIRQ13          = 13U,     /* PORT_EIRQ13 */
    INT_SRC_PORT_EIRQ14          = 14U,     /* PORT_EIRQ14 */
    INT_SRC_PORT_EIRQ15          = 15U,     /* PORT_EIRQ15 */
    /*  DMA_1  */
    INT_SRC_DMA1_TC0             = 32U,     /* DMA_1_TC0 */
    INT_SRC_DMA1_TC1             = 33U,     /* DMA_1_TC1 */
    INT_SRC_DMA1_TC2             = 34U,     /* DMA_1_TC2 */
    INT_SRC_DMA1_TC3             = 35U,     /* DMA_1_TC3 */
    INT_SRC_DMA1_TC4             = 36U,     /* DMA_1_TC4 */
    INT_SRC_DMA1_TC5             = 37U,     /* DMA_1_TC5 */
    INT_SRC_DMA1_TC6             = 38U,     /* DMA_1_TC6 */
    INT_SRC_DMA1_TC7             = 39U,     /* DMA_1_TC7 */
    INT_SRC_DMA1_BTC0            = 40U,     /* DMA_1_BTC0 */
    INT_SRC_DMA1_BTC1            = 41U,     /* DMA_1_BTC1 */
    INT_SRC_DMA1_BTC2            = 42U,     /* DMA_1_BTC2 */
    INT_SRC_DMA1_BTC3            = 43U,     /* DMA_1_BTC3 */
    INT_SRC_DMA1_BTC4            = 44U,     /* DMA_1_BTC4 */
    INT_SRC_DMA1_BTC5            = 45U,     /* DMA_1_BTC5 */
    INT_SRC_DMA1_BTC6            = 46U,     /* DMA_1_BTC6 */
    INT_SRC_DMA1_BTC7            = 47U,     /* DMA_1_BTC7 */
    INT_SRC_DMA1_ERR             = 48U,     /* DMA_1_ERR */
    /*  EFM  */
    INT_SRC_EFM_PEERR            = 49U,     /* EFM_PEERR */
    INT_SRC_EFM_RDCOL            = 50U,     /* EFM_RDCOL */
    INT_SRC_EFM_OPTEND           = 51U,     /* EFM_OPTEND */
    /*  QSPI  */
    INT_SRC_QSPI_INTR            = 54U,     /* QSPI_INTR */
    /*  DCU  */
    INT_SRC_DCU1                 = 55U,     /* DCU1 */
    INT_SRC_DCU2                 = 56U,     /* DCU2 */
    INT_SRC_DCU3                 = 57U,     /* DCU3 */
    INT_SRC_DCU4                 = 58U,     /* DCU4 */
    INT_SRC_DCU5                 = 59U,     /* DCU5 */
    INT_SRC_DCU6                 = 60U,     /* DCU6 */
    INT_SRC_DCU7                 = 61U,     /* DCU7 */
    INT_SRC_DCU8                 = 62U,     /* DCU8 */
    /*  DMA2  */
    INT_SRC_DMA2_TC0             = 64U,     /* DMA_2_TC0 */
    INT_SRC_DMA2_TC1             = 65U,     /* DMA_2_TC1 */
    INT_SRC_DMA2_TC2             = 66U,     /* DMA_2_TC2 */
    INT_SRC_DMA2_TC3             = 67U,     /* DMA_2_TC3 */
    INT_SRC_DMA2_TC4             = 68U,     /* DMA_2_TC4 */
    INT_SRC_DMA2_TC5             = 69U,     /* DMA_2_TC5 */
    INT_SRC_DMA2_TC6             = 70U,     /* DMA_2_TC6 */
    INT_SRC_DMA2_TC7             = 71U,     /* DMA_2_TC7 */
    INT_SRC_DMA2_BTC0            = 72U,     /* DMA_2_BTC0 */
    INT_SRC_DMA2_BTC1            = 73U,     /* DMA_2_BTC1 */
    INT_SRC_DMA2_BTC2            = 74U,     /* DMA_2_BTC2 */
    INT_SRC_DMA2_BTC3            = 75U,     /* DMA_2_BTC3 */
    INT_SRC_DMA2_BTC4            = 76U,     /* DMA_2_BTC4 */
    INT_SRC_DMA2_BTC5            = 77U,     /* DMA_2_BTC5 */
    INT_SRC_DMA2_BTC6            = 78U,     /* DMA_2_BTC6 */
    INT_SRC_DMA2_BTC7            = 79U,     /* DMA_2_BTC7 */
    INT_SRC_DMA2_ERR             = 80U,     /* DMA_2_ERR */
    /*  MAU  */
    INT_SRC_MAU_SQRT             = 83U,     /* MAU_SQRT */
    /*  DVP  */
    INT_SRC_DVP_FRAMSTA          = 84U,     /* DVP_FRAMSTA */
    INT_SRC_DVP_LINESTA          = 85U,     /* DVP_LINESTA */
    INT_SRC_DVP_LINEEND          = 86U,     /* DVP_LINEEND */
    INT_SRC_DVP_FRAMEND          = 87U,     /* DVP_FRAMEND */
    INT_SRC_DVP_SQUERR           = 88U,     /* DVP_SQUERR */
    INT_SRC_DVP_FIFOERR          = 89U,     /* DVP_FIFOERR */
    /*  FMAC  */
    INT_SRC_FMAC_1               = 91U,     /* FMAC_1_FIR */
    INT_SRC_FMAC_2               = 92U,     /* FMAC_2_FIR */
    INT_SRC_FMAC_3               = 93U,     /* FMAC_3_FIR */
    INT_SRC_FMAC_4               = 94U,     /* FMAC_4_FIR */
    /*  TIMER0  */
    INT_SRC_TMR0_1_CMP_A         = 96U,     /* TMR0_1_CMPA */
    INT_SRC_TMR0_1_CMP_B         = 97U,     /* TMR0_1_CMPB */
    INT_SRC_TMR0_2_CMP_A         = 98U,     /* TMR0_2_CMPA */
    INT_SRC_TMR0_2_CMP_B         = 99U,     /* TMR0_2_CMPB */
    /*  RTC  */
    INT_SRC_RTC_TP               = 120U,     /* RTC_TP */
    INT_SRC_RTC_ALM              = 121U,     /* RTC_ALM */
    INT_SRC_RTC_PRD              = 122U,     /* RTC_PRD */
    /*  XTAL  */
    INT_SRC_XTAL_STOP            = 125U,     /* XTAL_STOP */
    /*  WKTM  */
    INT_SRC_WKTM_PRD             = 126U,     /* WKTM_PRD */
    /*  SWDT  */
    INT_SRC_SWDT_REFUDF          = 127U,     /* SWDT_REFUDF */
    /*  TIMER6_1  */
    INT_SRC_TMR6_1_GCMP_A        = 128U,     /* TMR6_1_GCMA */
    INT_SRC_TMR6_1_GCMP_B        = 129U,     /* TMR6_1_GCMB */
    INT_SRC_TMR6_1_GCMP_C        = 130U,     /* TMR6_1_GCMC */
    INT_SRC_TMR6_1_GCMP_D        = 131U,     /* TMR6_1_GCMD */
    INT_SRC_TMR6_1_GCMP_E        = 132U,     /* TMR6_1_GCME */
    INT_SRC_TMR6_1_GCMP_F        = 133U,     /* TMR6_1_GCMF */
    INT_SRC_TMR6_1_OVF           = 134U,     /* TMR6_1_GOVF */
    INT_SRC_TMR6_1_UDF           = 135U,     /* TMR6_1_GUDF */
    /*  TIMER4_1  */
    INT_SRC_TMR4_1_GCMP_UH       = 136U,     /* TMR4_1_GCMUH */
    INT_SRC_TMR4_1_GCMP_UL       = 137U,     /* TMR4_1_GCMUL */
    INT_SRC_TMR4_1_GCMP_VH       = 138U,     /* TMR4_1_GCMVH */
    INT_SRC_TMR4_1_GCMP_VL       = 139U,     /* TMR4_1_GCMVL */
    INT_SRC_TMR4_1_GCMP_WH       = 140U,     /* TMR4_1_GCMWH */
    INT_SRC_TMR4_1_GCMP_WL       = 141U,     /* TMR4_1_GCMWL */
    INT_SRC_TMR4_1_OVF           = 142U,     /* TMR4_1_GOVF */
    INT_SRC_TMR4_1_UDF           = 143U,     /* TMR4_1_GUDF */
    /*  TIMER6_2  */
    INT_SRC_TMR6_2_GCMP_A        = 144U,     /* TMR6_2_GCMA */
    INT_SRC_TMR6_2_GCMP_B        = 145U,     /* TMR6_2_GCMB */
    INT_SRC_TMR6_2_GCMP_C        = 146U,     /* TMR6_2_GCMC */
    INT_SRC_TMR6_2_GCMP_D        = 147U,     /* TMR6_2_GCMD */
    INT_SRC_TMR6_2_GCMP_E        = 148U,     /* TMR6_2_GCME */
    INT_SRC_TMR6_2_GCMP_F        = 149U,     /* TMR6_2_GCMF */
    INT_SRC_TMR6_2_OVF           = 150U,     /* TMR6_2_GOVF */
    INT_SRC_TMR6_2_UDF           = 151U,     /* TMR6_2_GUDF */
    /*  TIMER4_2  */
    INT_SRC_TMR4_2_GCMP_UH       = 152U,     /* TMR4_2_GCMUH */
    INT_SRC_TMR4_2_GCMP_UL       = 153U,     /* TMR4_2_GCMUL */
    INT_SRC_TMR4_2_GCMP_VH       = 154U,     /* TMR4_2_GCMVH */
    INT_SRC_TMR4_2_GCMP_VL       = 155U,     /* TMR4_2_GCMVL */
    INT_SRC_TMR4_2_GCMP_WH       = 156U,     /* TMR4_2_GCMWH */
    INT_SRC_TMR4_2_GCMP_WL       = 157U,     /* TMR4_2_GCMWL */
    INT_SRC_TMR4_2_OVF           = 158U,     /* TMR4_2_GOVF */
    INT_SRC_TMR4_2_UDF           = 159U,     /* TMR4_2_GUDF */
    /*  TIMER6_3  */
    INT_SRC_TMR6_3_GCMP_A        = 160U,     /* TMR6_3_GCMA */
    INT_SRC_TMR6_3_GCMP_B        = 161U,     /* TMR6_3_GCMB */
    INT_SRC_TMR6_3_GCMP_C        = 162U,     /* TMR6_3_GCMC */
    INT_SRC_TMR6_3_GCMP_D        = 163U,     /* TMR6_3_GCMD */
    INT_SRC_TMR6_3_GCMP_E        = 164U,     /* TMR6_3_GCME */
    INT_SRC_TMR6_3_GCMP_F        = 165U,     /* TMR6_3_GCMF */
    INT_SRC_TMR6_3_OVF           = 166U,     /* TMR6_3_GOVF */
    INT_SRC_TMR6_3_UDF           = 167U,     /* TMR6_3_GUDF */
    /*  TIMER4_3  */
    INT_SRC_TMR4_3_GCMP_UH       = 168U,     /* TMR4_3_GCMUH */
    INT_SRC_TMR4_3_GCMP_UL       = 169U,     /* TMR4_3_GCMUL */
    INT_SRC_TMR4_3_GCMP_VH       = 170U,     /* TMR4_3_GCMVH */
    INT_SRC_TMR4_3_GCMP_VL       = 171U,     /* TMR4_3_GCMVL */
    INT_SRC_TMR4_3_GCMP_WH       = 172U,     /* TMR4_3_GCMWH */
    INT_SRC_TMR4_3_GCMP_WL       = 173U,     /* TMR4_3_GCMWL */
    INT_SRC_TMR4_3_OVF           = 174U,     /* TMR4_3_GOVF */
    INT_SRC_TMR4_3_UDF           = 175U,     /* TMR4_3_GUDF */
    /*  TIMER6_1  */
    INT_SRC_TMR6_1_DTE           = 176U,     /* TMR6_1_GDTE */
    INT_SRC_TMR6_1_SCMP_A        = 179U,     /* TMR6_1_SCMA */
    INT_SRC_TMR6_1_SCMP_B        = 180U,     /* TMR6_1_SCMB */
    /*  TIMER4_1  */
    INT_SRC_TMR4_1_RELOAD_U      = 181U,     /* TMR4_1_RLOU */
    INT_SRC_TMR4_1_RELOAD_V      = 182U,     /* TMR4_1_RLOV */
    INT_SRC_TMR4_1_RELOAD_W      = 183U,     /* TMR4_1_RLOW */
    /*  TIMER6_2  */
    INT_SRC_TMR6_2_DTE           = 184U,     /* TMR6_2_GDTE */
    INT_SRC_TMR6_2_SCMP_A        = 187U,     /* TMR6_2_SCMA */
    INT_SRC_TMR6_2_SCMP_B        = 188U,     /* TMR6_2_SCMB */
    /*  TIMER4_2  */
    INT_SRC_TMR4_2_RELOAD_U      = 189U,     /* TMR4_2_RLOU */
    INT_SRC_TMR4_2_RELOAD_V      = 190U,     /* TMR4_2_RLOV */
    INT_SRC_TMR4_2_RELOAD_W      = 191U,     /* TMR4_2_RLOW */
    /*  TIMER6_3  */
    INT_SRC_TMR6_3_DTE           = 192U,     /* TMR6_3_GDTE */
    INT_SRC_TMR6_3_SCMP_A        = 195U,     /* TMR6_3_SCMA */
    INT_SRC_TMR6_3_SCMP_B        = 196U,     /* TMR6_3_SCMB */
    /*  TIMER4_3  */
    INT_SRC_TMR4_3_RELOAD_U      = 197U,     /* TMR4_3_RLOU */
    INT_SRC_TMR4_3_RELOAD_V      = 198U,     /* TMR4_3_RLOV */
    INT_SRC_TMR4_3_RELOAD_W      = 199U,     /* TMR4_3_RLOW */
    /*  TIMERA_1  */
    INT_SRC_TMRA_1_OVF           = 237U,     /* TMRA_1_OVF */
    INT_SRC_TMRA_1_UDF           = 238U,     /* TMRA_1_UDF */
    INT_SRC_TMRA_1_CMP           = 239U,     /* TMRA_1_CMP */
    /*  TIMERA_2  */
    INT_SRC_TMRA_2_OVF           = 253U,     /* TMRA_2_OVF */
    INT_SRC_TMRA_2_UDF           = 254U,     /* TMRA_2_UDF */
    INT_SRC_TMRA_2_CMP           = 255U,     /* TMRA_2_CMP */
    /*  TIMERA_3  */
    INT_SRC_TMRA_3_OVF           = 269U,     /* TMRA_3_OVF */
    INT_SRC_TMRA_3_UDF           = 270U,     /* TMRA_3_UDF */
    INT_SRC_TMRA_3_CMP           = 271U,     /* TMRA_3_CMP */
    /*  TIMERA_4  */
    INT_SRC_TMRA_4_OVF           = 285U,     /* TMRA_4_OVF */
    INT_SRC_TMRA_4_UDF           = 286U,     /* TMRA_4_UDF */
    INT_SRC_TMRA_4_CMP           = 287U,     /* TMRA_4_CMP */
    /*  EMB  */
    INT_SRC_EMB_GR0              = 288U,     /* EMB_GR0 */
    INT_SRC_EMB_GR1              = 289U,     /* EMB_GR1 */
    INT_SRC_EMB_GR2              = 290U,     /* EMB_GR2 */
    INT_SRC_EMB_GR3              = 291U,     /* EMB_GR3 */
    INT_SRC_EMB_GR4              = 292U,     /* EMB_GR4 */
    INT_SRC_EMB_GR5              = 293U,     /* EMB_GR5 */
    INT_SRC_EMB_GR6              = 294U,     /* EMB_GR6 */
    /*  USBHS  */
    INT_SRC_USBHS_EP1_OUT        = 295U,     /* USBHS_EP1_OUT */
    INT_SRC_USBHS_EP1_IN         = 296U,     /* USBHS_EP1_IN */
    INT_SRC_USBHS_GLB            = 297U,     /* USBHS_GLB */
    INT_SRC_USBHS_WKUP           = 298U,     /* USBHS_WKUP */
    /*  USART1 USART2  */
    INT_SRC_USART1_EI            = 300U,     /* USART_1_EI */
    INT_SRC_USART1_RI            = 301U,     /* USART_1_RI */
    INT_SRC_USART1_TI            = 302U,     /* USART_1_TI */
    INT_SRC_USART1_TCI           = 303U,     /* USART_1_TCI */
    INT_SRC_USART1_RTO           = 304U,     /* USART_1_RTO */
    INT_SRC_USART2_EI            = 305U,     /* USART_2_EI */
    INT_SRC_USART2_RI            = 306U,     /* USART_2_RI */
    INT_SRC_USART2_TI            = 307U,     /* USART_2_TI */
    INT_SRC_USART2_TCI           = 308U,     /* USART_2_TCI */
    INT_SRC_USART2_RTO           = 309U,     /* USART_2_RTO */
    /*  SPI1 SPI2  */
    INT_SRC_SPI1_SPRI            = 310U,     /* SPI_1_SPRI */
    INT_SRC_SPI1_SPTI            = 311U,     /* SPI_1_SPTI */
    INT_SRC_SPI1_SPII            = 312U,     /* SPI_1_SPII */
    INT_SRC_SPI1_SPEI            = 313U,     /* SPI_1_SPEI */
    INT_SRC_SPI2_SPRI            = 315U,     /* SPI_2_SPRI */
    INT_SRC_SPI2_SPTI            = 316U,     /* SPI_2_SPTI */
    INT_SRC_SPI2_SPII            = 317U,     /* SPI_2_SPII */
    INT_SRC_SPI2_SPEI            = 318U,     /* SPI_2_SPEI */
    /*  TIMERA_5 TIMERA_6 TIMERA_7 TIMERA_8  */
    INT_SRC_TMRA_5_OVF           = 320U,     /* TMRA_5_OVF */
    INT_SRC_TMRA_5_UDF           = 321U,     /* TMRA_5_UDF */
    INT_SRC_TMRA_5_CMP           = 322U,     /* TMRA_5_CMP */
    INT_SRC_TMRA_6_OVF           = 323U,     /* TMRA_6_OVF */
    INT_SRC_TMRA_6_UDF           = 324U,     /* TMRA_6_UDF */
    INT_SRC_TMRA_6_CMP           = 325U,     /* TMRA_6_CMP */
    INT_SRC_TMRA_7_OVF           = 326U,     /* TMRA_7_OVF */
    INT_SRC_TMRA_7_UDF           = 327U,     /* TMRA_7_UDF */
    INT_SRC_TMRA_7_CMP           = 328U,     /* TMRA_7_CMP */
    INT_SRC_TMRA_8_OVF           = 329U,     /* TMRA_8_OVF */
    INT_SRC_TMRA_8_UDF           = 330U,     /* TMRA_8_UDF */
    INT_SRC_TMRA_8_CMP           = 331U,     /* TMRA_8_CMP */
    /*  USART3 USART4  */
    INT_SRC_USART3_EI            = 332U,     /* USART_3_EI */
    INT_SRC_USART3_RI            = 333U,     /* USART_3_RI */
    INT_SRC_USART3_TI            = 334U,     /* USART_3_TI */
    INT_SRC_USART3_TCI           = 335U,     /* USART_3_TCI */
    INT_SRC_USART4_EI            = 336U,     /* USART_4_EI */
    INT_SRC_USART4_RI            = 337U,     /* USART_4_RI */
    INT_SRC_USART4_TI            = 338U,     /* USART_4_TI */
    INT_SRC_USART4_TCI           = 339U,     /* USART_4_TCI */
    /*  CAN1 CAN2  */
    INT_SRC_CAN1_HOST            = 340U,     /* CAN_1_HOST */
    INT_SRC_CAN2_HOST            = 341U,     /* CAN_2_HOST */
    /*  SPI3 SPI4  */
    INT_SRC_SPI3_SPRI            = 342U,     /* SPI_3_SPRI */
    INT_SRC_SPI3_SPTI            = 343U,     /* SPI_3_SPTI */
    INT_SRC_SPI3_SPII            = 344U,     /* SPI_3_SPII */
    INT_SRC_SPI3_SPEI            = 345U,     /* SPI_3_SPEI */
    INT_SRC_SPI4_SPRI            = 347U,     /* SPI_4_SPRI */
    INT_SRC_SPI4_SPTI            = 348U,     /* SPI_4_SPTI */
    INT_SRC_SPI4_SPII            = 349U,     /* SPI_4_SPII */
    INT_SRC_SPI4_SPEI            = 350U,     /* SPI_4_SPEI */
    /*  USART5 USART6  */
    INT_SRC_USART5_BRKWKPI       = 364U,     /* USART_5_BRKWKPI */
    INT_SRC_USART5_EI            = 365U,     /* USART_5_EI */
    INT_SRC_USART5_RI            = 366U,     /* USART_5_RI */
    INT_SRC_USART5_TI            = 367U,     /* USART_5_TI */
    INT_SRC_USART5_TCI           = 368U,     /* USART_5_TCI */
    INT_SRC_USART6_EI            = 369U,     /* USART_6_EI */
    INT_SRC_USART6_RI            = 370U,     /* USART_6_RI */
    INT_SRC_USART6_TI            = 371U,     /* USART_6_TI */
    INT_SRC_USART6_TCI           = 372U,     /* USART_6_TCI */
    INT_SRC_USART6_RTO           = 373U,     /* USART_6_RTO */
    /*  SPI5 SPI6  */
    INT_SRC_SPI5_SPRI            = 374U,     /* SPI_5_SPRI */
    INT_SRC_SPI5_SPTI            = 375U,     /* SPI_5_SPTI */
    INT_SRC_SPI5_SPII            = 376U,     /* SPI_5_SPII */
    INT_SRC_SPI5_SPEI            = 377U,     /* SPI_5_SPEI */
    INT_SRC_SPI6_SPRI            = 379U,     /* SPI_6_SPRI */
    INT_SRC_SPI6_SPTI            = 380U,     /* SPI_6_SPTI */
    INT_SRC_SPI6_SPII            = 381U,     /* SPI_6_SPII */
    INT_SRC_SPI6_SPEI            = 382U,     /* SPI_6_SPEI */
    /*  I2S1 I2S2  */
    INT_SRC_I2S1_TXIRQOUT        = 384U,     /* I2S_1_TXIRQOUT */
    INT_SRC_I2S1_RXIRQOUT        = 385U,     /* I2S_1_RXIRQOUT */
    INT_SRC_I2S1_ERRIRQOUT       = 386U,     /* I2S_1_ERRIRQOUT */
    INT_SRC_I2S2_TXIRQOUT        = 387U,     /* I2S_2_TXIRQOUT */
    INT_SRC_I2S2_RXIRQOUT        = 388U,     /* I2S_2_RXIRQOUT */
    INT_SRC_I2S2_ERRIRQOUT       = 389U,     /* I2S_2_ERRIRQOUT */
    /*  USART7  */
    INT_SRC_USART7_EI            = 390U,     /* USART_7_EI */
    INT_SRC_USART7_RI            = 391U,     /* USART_7_RI */
    INT_SRC_USART7_TI            = 392U,     /* USART_7_TI */
    INT_SRC_USART7_TCI           = 393U,     /* USART_7_TCI */
    INT_SRC_USART7_RTO           = 394U,     /* USART_7_RTO */
    /*  USBFS  */
    INT_SRC_USBFS_GLB            = 399U,     /* USBFS_GLB */
    INT_SRC_USBFS_WKUP           = 400U,     /* USBFS_WKUP */
    /*  HASH  */
    INT_SRC_HASH                 = 401U,     /* HASH_INT */
    /*  SDIOC  */
    INT_SRC_SDIOC1_SD            = 404U,     /* SDIOC_1_SD */
    INT_SRC_SDIOC2_SD            = 407U,     /* SDIOC_2_SD */
    /*  EVENT PORT  */
    INT_SRC_EVENT_PORT1          = 408U,     /* EVENT_PORT1 */
    INT_SRC_EVENT_PORT2          = 409U,     /* EVENT_PORT2 */
    INT_SRC_EVENT_PORT3          = 410U,     /* EVENT_PORT3 */
    INT_SRC_EVENT_PORT4          = 411U,     /* EVENT_PORT4 */
    /*  ETHER  */
    INT_SRC_ETH_GLB_INT          = 412U,     /* ETH_GLB_INT */
    INT_SRC_ETH_WKP_INT          = 413U,     /* ETH_WKP_INT */
    /*  I2S3 I2S4  */
    INT_SRC_I2S3_TXIRQOUT        = 416U,     /* I2S_3_TXIRQOUT */
    INT_SRC_I2S3_RXIRQOUT        = 417U,     /* I2S_3_RXIRQOUT */
    INT_SRC_I2S3_ERRIRQOUT       = 418U,     /* I2S_3_ERRIRQOUT */
    INT_SRC_I2S4_TXIRQOUT        = 419U,     /* I2S_4_TXIRQOUT */
    INT_SRC_I2S4_RXIRQOUT        = 420U,     /* I2S_4_RXIRQOUT */
    INT_SRC_I2S4_ERRIRQOUT       = 421U,     /* I2S_4_ERRIRQOUT */
    /*  USART10  */
    INT_SRC_USART10_BRKWKPI      = 426U,     /* USART_10_BRKWKPI */
    INT_SRC_USART10_EI           = 427U,     /* USART_10_EI */
    INT_SRC_USART10_RI           = 428U,     /* USART_10_RI */
    INT_SRC_USART10_TI           = 429U,     /* USART_10_TI */
    INT_SRC_USART10_TCI          = 430U,     /* USART_10_TCI */
    /*  I2C1 I2C2 I2C3  */
    INT_SRC_I2C1_RXI             = 432U,     /* I2C_1_RXI */
    INT_SRC_I2C1_TXI             = 433U,     /* I2C_1_TXI */
    INT_SRC_I2C1_TEI             = 434U,     /* I2C_1_TEI */
    INT_SRC_I2C1_EEI             = 435U,     /* I2C_1_EEI */
    INT_SRC_I2C2_RXI             = 436U,     /* I2C_2_RXI */
    INT_SRC_I2C2_TXI             = 437U,     /* I2C_2_TXI */
    INT_SRC_I2C2_TEI             = 438U,     /* I2C_2_TEI */
    INT_SRC_I2C2_EEI             = 439U,     /* I2C_2_EEI */
    INT_SRC_I2C3_RXI             = 440U,     /* I2C_3_RXI */
    INT_SRC_I2C3_TXI             = 441U,     /* I2C_3_TXI */
    INT_SRC_I2C3_TEI             = 442U,     /* I2C_3_TEI */
    INT_SRC_I2C3_EEI             = 443U,     /* I2C_3_EEI */
    /*  ACMP  */
    INT_SRC_CMP1                 = 444U,     /* CMP1 */
    INT_SRC_CMP2                 = 445U,     /* CMP2 */
    INT_SRC_CMP3                 = 446U,     /* CMP3 */
    /*  USART1  */
    INT_SRC_USART1_WUPI          = 460U,     /* USART_1_WUPI */
    /*  LVD  */
    INT_SRC_LVD1                = 461U,     /* LVD1 */
    INT_SRC_LVD2                = 462U,     /* LVD2 */
    /*  OTS  */
    INT_SRC_OTS                  = 463U,     /* OTS */
    /*  FCM  */
    INT_SRC_FCMFERRI             = 464U,     /* FCMFERRI */
    INT_SRC_FCMMENDI             = 465U,     /* FCMMENDI */
    INT_SRC_FCMCOVFI             = 466U,     /* FCMCOVFI */
    /*  WDT  */
    INT_SRC_WDT_REFUDF           = 467U,     /* WDT_REFUDF */
    /*  CTC  */
    INT_SRC_CTC_ERR              = 468U,     /* CTC_ERR */
    /*  ADC  */
    INT_SRC_ADC1_EOCA            = 480U,     /* ADC_1_EOCA */
    INT_SRC_ADC1_EOCB            = 481U,     /* ADC_1_EOCB */
    INT_SRC_ADC1_CMP0            = 482U,     /* ADC_1_CMP0 */
    INT_SRC_ADC1_CMP1            = 483U,     /* ADC_1_CMP1 */
    INT_SRC_ADC2_EOCA            = 484U,     /* ADC_2_EOCA */
    INT_SRC_ADC2_EOCB            = 485U,     /* ADC_2_EOCB */
    INT_SRC_ADC2_CMP0            = 486U,     /* ADC_2_CMP0 */
    INT_SRC_ADC2_CMP1            = 487U,     /* ADC_2_CMP1 */
    INT_SRC_ADC3_EOCA            = 488U,     /* ADC_3_EOCA */
    INT_SRC_ADC3_EOCB            = 489U,     /* ADC_3_EOCB */
    INT_SRC_ADC3_CMP0            = 490U,     /* ADC_3_CMP0 */
    INT_SRC_ADC3_CMP1            = 491U,     /* ADC_3_CMP1 */
    /*  TRNG  */
    INT_SRC_TRNG_END             = 492U,     /* TRNG_END */
    /*  NFC  */
    INT_SRC_NFC_INT              = 496U,     /* NFC_INT */
    INT_SRC_MAX                  = 511U,
} en_int_src_t;

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

