hdscmcu/sdk-csp-hc32f4/libraries/cmsis/Device/HDSC/hc32f4xx/Include/hc32f467.h
/*  Bit definition for DVP_CPSZER register  */
#define DVP_CPSZER_RSIZE_POS                           (0U)
#define DVP_CPSZER_RSIZE                               (0x00003FFFUL)
#define DVP_CPSZER_CSIZE_POS                           (16U)
#define DVP_CPSZER_CSIZE                               (0x3FFF0000UL)

/*******************************************************************************
                Bit definition for Peripheral EFM
*******************************************************************************/
/*  Bit definition for EFM_FAPRT register  */
#define EFM_FAPRT_FAPRT                                (0x0000FFFFUL)

/*  Bit definition for EFM_KEY1 register  */
#define EFM_KEY1                                       (0xFFFFFFFFUL)

/*  Bit definition for EFM_KEY2 register  */
#define EFM_KEY2                                       (0xFFFFFFFFUL)

/*  Bit definition for EFM_FSTP register  */
#define EFM_FSTP_F0STP                                 (0x00000001UL)

/*  Bit definition for EFM_FRMC register  */
#define EFM_FRMC_FLWT_POS                              (0U)
#define EFM_FRMC_FLWT                                  (0x0000000FUL)
#define EFM_FRMC_LVM_POS                               (8U)
#define EFM_FRMC_LVM                                   (0x00000100UL)
#define EFM_FRMC_ICACHE_POS                            (16U)
#define EFM_FRMC_ICACHE                                (0x00010000UL)
#define EFM_FRMC_DCACHE_POS                            (17U)
#define EFM_FRMC_DCACHE                                (0x00020000UL)
#define EFM_FRMC_PREFETE_POS                           (18U)
#define EFM_FRMC_PREFETE                               (0x00040000UL)
#define EFM_FRMC_CRST_POS                              (19U)
#define EFM_FRMC_CRST                                  (0x00080000UL)

/*  Bit definition for EFM_FWMC register  */
#define EFM_FWMC_PEMOD_POS                             (0U)
#define EFM_FWMC_PEMOD                                 (0x00000007UL)
#define EFM_FWMC_BUSHLDCTL_POS                         (8U)
#define EFM_FWMC_BUSHLDCTL                             (0x00000100UL)
#define EFM_FWMC_KEY1LOCK_POS                          (16U)
#define EFM_FWMC_KEY1LOCK                              (0x00010000UL)
#define EFM_FWMC_KEY2LOCK_POS                          (17U)
#define EFM_FWMC_KEY2LOCK                              (0x00020000UL)

/*  Bit definition for EFM_FSR register  */
#define EFM_FSR_OTPWERR0_POS                           (0U)
#define EFM_FSR_OTPWERR0                               (0x00000001UL)
#define EFM_FSR_PRTWERR0_POS                           (1U)
#define EFM_FSR_PRTWERR0                               (0x00000002UL)
#define EFM_FSR_PGSZERR0_POS                           (2U)
#define EFM_FSR_PGSZERR0                               (0x00000004UL)
#define EFM_FSR_MISMTCH0_POS                           (3U)
#define EFM_FSR_MISMTCH0                               (0x00000008UL)
#define EFM_FSR_OPTEND0_POS                            (4U)
#define EFM_FSR_OPTEND0                                (0x00000010UL)
#define EFM_FSR_COLERR0_POS                            (5U)
#define EFM_FSR_COLERR0                                (0x00000020UL)
#define EFM_FSR_RDY0_POS                               (8U)
#define EFM_FSR_RDY0                                   (0x00000100UL)

/*  Bit definition for EFM_FSCLR register  */
#define EFM_FSCLR_OTPWERRCLR0_POS                      (0U)
#define EFM_FSCLR_OTPWERRCLR0                          (0x00000001UL)
#define EFM_FSCLR_PRTWERRCLR0_POS                      (1U)
#define EFM_FSCLR_PRTWERRCLR0                          (0x00000002UL)
#define EFM_FSCLR_PGSZERRCLR0_POS                      (2U)
#define EFM_FSCLR_PGSZERRCLR0                          (0x00000004UL)
#define EFM_FSCLR_MISMTCHCLR0_POS                      (3U)
#define EFM_FSCLR_MISMTCHCLR0                          (0x00000008UL)
#define EFM_FSCLR_OPTENDCLR0_POS                       (4U)
#define EFM_FSCLR_OPTENDCLR0                           (0x00000010UL)
#define EFM_FSCLR_COLERRCLR0_POS                       (5U)
#define EFM_FSCLR_COLERRCLR0                           (0x00000020UL)

/*  Bit definition for EFM_FITE register  */
#define EFM_FITE_PEERRITE_POS                          (0U)
#define EFM_FITE_PEERRITE                              (0x00000001UL)
#define EFM_FITE_OPTENDITE_POS                         (1U)
#define EFM_FITE_OPTENDITE                             (0x00000002UL)
#define EFM_FITE_COLERRITE_POS                         (2U)
#define EFM_FITE_COLERRITE                             (0x00000004UL)

/*  Bit definition for EFM_UQID0 register  */
#define EFM_UQID0                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_UQID1 register  */
#define EFM_UQID1                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_UQID2 register  */
#define EFM_UQID2                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_MMF_REMPRT register  */
#define EFM_MMF_REMPRT_MMF_REMPRT                      (0x0000FFFFUL)

/*  Bit definition for EFM_MMF_REMCR register  */
#define EFM_MMF_REMCR_RMSIZE_POS                       (0U)
#define EFM_MMF_REMCR_RMSIZE                           (0x0000001FUL)
#define EFM_MMF_REMCR_RMTADDR_POS                      (12U)
#define EFM_MMF_REMCR_RMTADDR                          (0x1FFFF000UL)
#define EFM_MMF_REMCR_EN_POS                           (31U)
#define EFM_MMF_REMCR_EN                               (0x80000000UL)

/*  Bit definition for EFM_WLOCK register  */
#define EFM_WLOCK_WLOCK                                (0x0000000FUL)
#define EFM_WLOCK_WLOCK_0                              (0x00000001UL)
#define EFM_WLOCK_WLOCK_1                              (0x00000002UL)
#define EFM_WLOCK_WLOCK_2                              (0x00000004UL)
#define EFM_WLOCK_WLOCK_3                              (0x00000008UL)

/*  Bit definition for EFM_F0NWPRT0 register  */
#define EFM_F0NWPRT0_F0NWPRT0_POS                      (0U)
#define EFM_F0NWPRT0_F0NWPRT0                          (0x00000001UL)
#define EFM_F0NWPRT0_F0NWPRT1_POS                      (1U)
#define EFM_F0NWPRT0_F0NWPRT1                          (0x00000002UL)
#define EFM_F0NWPRT0_F0NWPRT2_POS                      (2U)
#define EFM_F0NWPRT0_F0NWPRT2                          (0x00000004UL)
#define EFM_F0NWPRT0_F0NWPRT3_POS                      (3U)
#define EFM_F0NWPRT0_F0NWPRT3                          (0x00000008UL)
#define EFM_F0NWPRT0_F0NWPRT4_POS                      (4U)
#define EFM_F0NWPRT0_F0NWPRT4                          (0x00000010UL)
#define EFM_F0NWPRT0_F0NWPRT5_POS                      (5U)
#define EFM_F0NWPRT0_F0NWPRT5                          (0x00000020UL)
#define EFM_F0NWPRT0_F0NWPRT6_POS                      (6U)
#define EFM_F0NWPRT0_F0NWPRT6                          (0x00000040UL)
#define EFM_F0NWPRT0_F0NWPRT7_POS                      (7U)
#define EFM_F0NWPRT0_F0NWPRT7                          (0x00000080UL)
#define EFM_F0NWPRT0_F0NWPRT8_POS                      (8U)
#define EFM_F0NWPRT0_F0NWPRT8                          (0x00000100UL)
#define EFM_F0NWPRT0_F0NWPRT9_POS                      (9U)
#define EFM_F0NWPRT0_F0NWPRT9                          (0x00000200UL)
#define EFM_F0NWPRT0_F0NWPRT10_POS                     (10U)
#define EFM_F0NWPRT0_F0NWPRT10                         (0x00000400UL)
#define EFM_F0NWPRT0_F0NWPRT11_POS                     (11U)
#define EFM_F0NWPRT0_F0NWPRT11                         (0x00000800UL)
#define EFM_F0NWPRT0_F0NWPRT12_POS                     (12U)
#define EFM_F0NWPRT0_F0NWPRT12                         (0x00001000UL)
#define EFM_F0NWPRT0_F0NWPRT13_POS                     (13U)
#define EFM_F0NWPRT0_F0NWPRT13                         (0x00002000UL)
#define EFM_F0NWPRT0_F0NWPRT14_POS                     (14U)
#define EFM_F0NWPRT0_F0NWPRT14                         (0x00004000UL)
#define EFM_F0NWPRT0_F0NWPRT15_POS                     (15U)
#define EFM_F0NWPRT0_F0NWPRT15                         (0x00008000UL)
#define EFM_F0NWPRT0_F0NWPRT16_POS                     (16U)
#define EFM_F0NWPRT0_F0NWPRT16                         (0x00010000UL)
#define EFM_F0NWPRT0_F0NWPRT17_POS                     (17U)
#define EFM_F0NWPRT0_F0NWPRT17                         (0x00020000UL)
#define EFM_F0NWPRT0_F0NWPRT18_POS                     (18U)
#define EFM_F0NWPRT0_F0NWPRT18                         (0x00040000UL)
#define EFM_F0NWPRT0_F0NWPRT19_POS                     (19U)
#define EFM_F0NWPRT0_F0NWPRT19                         (0x00080000UL)
#define EFM_F0NWPRT0_F0NWPRT20_POS                     (20U)
#define EFM_F0NWPRT0_F0NWPRT20                         (0x00100000UL)
#define EFM_F0NWPRT0_F0NWPRT21_POS                     (21U)
#define EFM_F0NWPRT0_F0NWPRT21                         (0x00200000UL)
#define EFM_F0NWPRT0_F0NWPRT22_POS                     (22U)
#define EFM_F0NWPRT0_F0NWPRT22                         (0x00400000UL)
#define EFM_F0NWPRT0_F0NWPRT23_POS                     (23U)
#define EFM_F0NWPRT0_F0NWPRT23                         (0x00800000UL)
#define EFM_F0NWPRT0_F0NWPRT24_POS                     (24U)
#define EFM_F0NWPRT0_F0NWPRT24                         (0x01000000UL)
#define EFM_F0NWPRT0_F0NWPRT25_POS                     (25U)
#define EFM_F0NWPRT0_F0NWPRT25                         (0x02000000UL)
#define EFM_F0NWPRT0_F0NWPRT26_POS                     (26U)
#define EFM_F0NWPRT0_F0NWPRT26                         (0x04000000UL)
#define EFM_F0NWPRT0_F0NWPRT27_POS                     (27U)
#define EFM_F0NWPRT0_F0NWPRT27                         (0x08000000UL)
#define EFM_F0NWPRT0_F0NWPRT28_POS                     (28U)
#define EFM_F0NWPRT0_F0NWPRT28                         (0x10000000UL)
#define EFM_F0NWPRT0_F0NWPRT29_POS                     (29U)
#define EFM_F0NWPRT0_F0NWPRT29                         (0x20000000UL)
#define EFM_F0NWPRT0_F0NWPRT30_POS                     (30U)
#define EFM_F0NWPRT0_F0NWPRT30                         (0x40000000UL)
#define EFM_F0NWPRT0_F0NWPRT31_POS                     (31U)
#define EFM_F0NWPRT0_F0NWPRT31                         (0x80000000UL)

