hdscmcu/sdk-csp-hc32f4/libraries/cmsis/Device/HDSC/hc32f4xx/Include/hc32f467.h
typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t PWMSINTEN;
    __IO uint32_t CMPINTEN;
    __IO uint32_t OSINTEN;
    uint32_t RESERVED1[4];
    __IO uint32_t PORTININTEN1;
    __IO uint32_t PORTININTEN2;
    __IO uint32_t PORTININTEN3;
    __IO uint32_t PORTININTEN4;
    uint32_t RESERVED2[20];
} stc_emb_inten_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t PWMRSEL;
    __IO uint32_t CMPRSEL;
    __IO uint32_t OSRSEL;
    uint32_t RESERVED1[4];
    __IO uint32_t PORTINRSEL1;
    __IO uint32_t PORTINRSEL2;
    __IO uint32_t PORTINRSEL3;
    __IO uint32_t PORTINRSEL4;
    uint32_t RESERVED2[20];
} stc_emb_rlssel_bit_t;

typedef struct {
    __IO uint32_t IFSEL;
    uint32_t RESERVED0[3];
    __IO uint32_t RCKINV;
    __IO uint32_t TCKINV;
    uint32_t RESERVED1[26];
} stc_eth_mac_ifconfr_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t RE;
    __IO uint32_t TE;
    __IO uint32_t DC;
    uint32_t RESERVED1[2];
    __IO uint32_t ACS;
    uint32_t RESERVED2[1];
    __IO uint32_t DRTY;
    __IO uint32_t IPCO;
    __IO uint32_t DM;
    __IO uint32_t LM;
    __IO uint32_t DO;
    __IO uint32_t FES;
    uint32_t RESERVED3[1];
    __IO uint32_t DCRS;
    uint32_t RESERVED4[5];
    __IO uint32_t MJB;
    __IO uint32_t MWD;
    uint32_t RESERVED5[1];
    __IO uint32_t CST;
    uint32_t RESERVED6[6];
} stc_eth_mac_configr_bit_t;

typedef struct {
    __IO uint32_t PR;
    __IO uint32_t HUC;
    __IO uint32_t HMC;
    __IO uint32_t DAIF;
    __IO uint32_t PMF;
    __IO uint32_t DBF;
    uint32_t RESERVED0[2];
    __IO uint32_t SAIF;
    __IO uint32_t SAF;
    __IO uint32_t HPF;
    uint32_t RESERVED1[5];
    __IO uint32_t VTFE;
    uint32_t RESERVED2[3];
    __IO uint32_t IPFE;
    __IO uint32_t DNTU;
    uint32_t RESERVED3[9];
    __IO uint32_t RA;
} stc_eth_mac_fltctlr_bit_t;

typedef struct {
    __IO uint32_t SMIB;
    __IO uint32_t SMIW;
    uint32_t RESERVED0[30];
} stc_eth_mac_smiaddr_bit_t;

typedef struct {
    __IO uint32_t FCA_BPA;
    __IO uint32_t TFE;
    __IO uint32_t RFE;
    __IO uint32_t UNP;
    uint32_t RESERVED0[3];
    __IO uint32_t DZPQ;
    uint32_t RESERVED1[24];
} stc_eth_mac_floctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[16];
    __IO uint32_t VTAL;
    __IO uint32_t VTIM;
    uint32_t RESERVED1[1];
    __IO uint32_t VTHM;
    uint32_t RESERVED2[12];
} stc_eth_mac_vtafltr_bit_t;

typedef struct {
    __I  uint32_t MREA;
    uint32_t RESERVED0[3];
    __I  uint32_t RFWA;
    uint32_t RESERVED1[11];
    __I  uint32_t MTEA;
    uint32_t RESERVED2[2];
    __I  uint32_t MTP;
    uint32_t RESERVED3[2];
    __I  uint32_t TFWA;
    uint32_t RESERVED4[1];
    __I  uint32_t TFNE;
    __I  uint32_t TFF;
    uint32_t RESERVED5[6];
} stc_eth_mac_macstsr_bit_t;

typedef struct {
    __IO uint32_t PWDN;
    __IO uint32_t MPEN;
    __IO uint32_t WKEN;
    uint32_t RESERVED0[2];
    __I  uint32_t MPFR;
    __I  uint32_t WKFR;
    uint32_t RESERVED1[2];
    __IO uint32_t GLUB;
    __IO uint32_t RTWKTR;
    uint32_t RESERVED2[20];
    __IO uint32_t RTWKFR;
} stc_eth_mac_pmtctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __I  uint32_t PMTIS;
    __I  uint32_t MMCIS;
    __I  uint32_t MMCRXIS;
    __I  uint32_t MMCTXIS;
    uint32_t RESERVED1[2];
    __I  uint32_t TSPIS;
    uint32_t RESERVED2[22];
} stc_eth_mac_intstsr_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __IO uint32_t PMTIM;
    uint32_t RESERVED1[5];
    __IO uint32_t TSPIM;
    uint32_t RESERVED2[22];
} stc_eth_mac_intmskr_bit_t;

typedef struct {
    uint32_t RESERVED0[31];
    __I  uint32_t AE0;
} stc_eth_mac_macadhr0_bit_t;

typedef struct {
    uint32_t RESERVED0[30];
    __IO uint32_t SA1;
    __IO uint32_t AE1;
} stc_eth_mac_macadhr1_bit_t;

typedef struct {
    uint32_t RESERVED0[30];
    __IO uint32_t SA2;
    __IO uint32_t AE2;
} stc_eth_mac_macadhr2_bit_t;

typedef struct {
    uint32_t RESERVED0[30];
    __IO uint32_t SA3;
    __IO uint32_t AE3;
} stc_eth_mac_macadhr3_bit_t;

typedef struct {
    uint32_t RESERVED0[30];
    __IO uint32_t SA4;
    __IO uint32_t AE4;
} stc_eth_mac_macadhr4_bit_t;

typedef struct {
    __IO uint32_t CRST;
    __IO uint32_t COS;
    __IO uint32_t ROR;
    __IO uint32_t MCF;
    __IO uint32_t MCPSET;
    __IO uint32_t MCPSEL;
    uint32_t RESERVED0[26];
} stc_eth_mmc_mmcctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __I  uint32_t RXBGIS;
    __I  uint32_t RXMGIS;
    __I  uint32_t RXCEIS;
    __I  uint32_t RXAEIS;
    __I  uint32_t RXREIS;
    uint32_t RESERVED1[9];
    __I  uint32_t RXUGIS;
    __I  uint32_t RXLEIS;
    __I  uint32_t RXOEIS;
    uint32_t RESERVED2[12];
} stc_eth_mmc_revstsr_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __I  uint32_t TXBGIS;
    __I  uint32_t TXMGIS;
    uint32_t RESERVED1[12];
    __I  uint32_t TXDEEIS;
    __I  uint32_t TXLCEIS;
    __I  uint32_t TXECEIS;
    __I  uint32_t TXCAEIS;
    uint32_t RESERVED2[1];
    __I  uint32_t TXUGIS;
    __I  uint32_t TXEDEIS;
    uint32_t RESERVED3[9];
} stc_eth_mmc_trsstsr_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __IO uint32_t RXBGIM;
    __IO uint32_t RXMGIM;
    __IO uint32_t RXCEIM;
    __IO uint32_t RXAEIM;
    __IO uint32_t RXREIM;
    uint32_t RESERVED1[9];
    __IO uint32_t RXUGIM;
    __IO uint32_t RXLEIM;
    __IO uint32_t RXOEIM;
    uint32_t RESERVED2[12];
} stc_eth_mmc_ritctlr_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t TXBGIM;
    __IO uint32_t TXMGIM;
    uint32_t RESERVED1[12];
    __IO uint32_t TXDEEIM;
    __IO uint32_t TXLCEIM;
    __IO uint32_t TXECEIM;
    __IO uint32_t TXCAEIM;
    uint32_t RESERVED2[1];
    __IO uint32_t TXUGIM;
    __IO uint32_t TXEDEIM;
    uint32_t RESERVED3[9];
} stc_eth_mmc_titctlr_bit_t;

typedef struct {
    __IO uint32_t L3PEN;
    uint32_t RESERVED0[1];
    __IO uint32_t L3SAM;
    __IO uint32_t L3SAIM;
    __IO uint32_t L3DAM;
    __IO uint32_t L3DAIM;
    uint32_t RESERVED1[10];
    __IO uint32_t L4PEN;
    uint32_t RESERVED2[1];
    __IO uint32_t L4SPM;
    __IO uint32_t L4SPIM;
    __IO uint32_t L4DPM;
    __IO uint32_t L4DPIM;
    uint32_t RESERVED3[10];
} stc_eth_mac_l34ctlr_bit_t;

